// Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.

Console.Write("Введите число:");
int N = Convert.ToInt32(Console.ReadLine());

for(int i=1;i<=N;i++) 
  Console.WriteLine($"{i} {i*i}");